---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseC
source: html/4ce9af8d-7da1-cc2d-b56c-526fb60c8e4c.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseC Property

The TrueLoadPhaseC value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueLoadPhaseC { get; }
```

## Remarks
This property is used to retrieve the TrueLoadPhaseC value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!